saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/NXP.MKL82Z7_DFP.11.0.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd" schemaVersion="1.4">
  <name>MKL82Z7_DFP</name>
  <vendor>NXP</vendor>
  <description>Device Family Pack for MKL82Z7</description>
  <url>http://mcuxpresso.nxp.com/cmsis_pack/repo/</url>
  <license>Licenses.txt</license>
  <releases>
    <release version="11.0.0">NXP CMSIS packs based on MCUXpresso SDK 2.5.0</release>
    <release version="10.0.3">A problem with missing components from some example the projects were dependent on was fixed (KEX-4241); Incorrect path to linked libraries were fixed: a pack version was a static part of the path and hadn’t worked for pack versions other than v10.0.0 (KEX-4373); A problem with incorrectly defined XIP_BOOT_HEADER_ENABLE, XIP_BOOT_HEADER_DCD_ENABLE and XIP_EXTERNAL_FLASH preprocessor symbols was fixed (KEX-4553); Missing flash algorithms for MK27, MK28, LPC802 and LPC804 device family packs were added (KEX-4659).</release>
    <release version="10.0.2">NXP CMSIS packs based on MCUXpresso SDK 2.4.0</release>
    <release version="10.0.1">NXP CMSIS packs based on MCUXpresso SDK 2.3.1</release>
    <release version="10.0.0">NXP CMSIS packs with updated Clear BSD license, based on MCUXpresso SDK 2.3.0. NXP CMSIS pack will maintain independent versioning starting with 10.0.0</release>
    <release version="2.3.0">NXP MCUXpresso SDK 2.3.0 CMSIS packs with updated Clear BSD license</release>
  </releases>
  <keywords>
    <keyword>Device Family Pack</keyword>
  </keywords>
  <taxonomy>
    <description Cclass="Device" Cgroup="SDK Project Template">NXP MCUXpresso SDK RTE Device Project Template</description>
    <description Cclass="Device" Cgroup="SDK Drivers">NXP MCUXpresso SDK Peripheral Drivers</description>
    <description Cclass="Device" Cgroup="SDK Utilities">NXP MCUXpresso SDK Utilities</description>
    <description Cclass="CMSIS Driver">NXP MCUXpresso SDK Peripheral CMSIS Drivers</description>
    <description Cclass="Board Support" Cgroup="SDK Project Template">NXP MCUXpresso SDK Project Template</description>
    <description Cclass="Device" Cgroup="Startup">NXP MCUXpresso SDK Start up</description>
  </taxonomy>
  <devices>
    <family Dfamily="MKL82Z7" Dvendor="NXP:11">
      <description>The Kinetis® KL8x MCU expands on the Kinetis low-power MCU portfolio with rich security features including tamper detection, true random number generator and low-power trusted crypto engine supporting AES, DES, 3DES, SHA, RSA and ECC.</description>
      <device Dname="MKL82Z128xxx7">
        <processor Dcore="Cortex-M0+" Dfpu="NO_FPU" Dendian="Little-endian" Dclock="96000000"/>
        <environment name="iar">
          <file category="linkerfile" name="iar/MKL82Z128xxx7_flash.icf"/>
        </environment>
        <memory name="PROGRAM_FLASH" start="0x00000000" size="0x020000" access="rx" default="1" startup="1"/>
        <memory name="SRAM" start="0x1fffa000" size="0x018000" access="rw" default="1"/>
        <memory name="USB_RAM" start="0x40100000" size="0x0800" access="rw"/>
        <algorithm name="arm/MKL_P128.FLM" start="0x00000000" size="0x00020000" RAMstart="0x1fffa000" RAMsize="0x00001000" default="1"/>
        <debug svd="MKL82Z7.xml"/>
        <variant Dvariant="MKL82Z128VLH7">
          <compile header="fsl_device_registers.h" define="CPU_MKL82Z128VLH7"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKL82Z128VLH7/MKL82Z128xxx7_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MKL82Z128VLK7">
          <compile header="fsl_device_registers.h" define="CPU_MKL82Z128VLK7"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKL82Z128VLK7/MKL82Z128xxx7_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MKL82Z128VLL7">
          <compile header="fsl_device_registers.h" define="CPU_MKL82Z128VLL7"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKL82Z128VLL7/MKL82Z128xxx7_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MKL82Z128VMC7">
          <compile header="fsl_device_registers.h" define="CPU_MKL82Z128VMC7"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKL82Z128VMC7/MKL82Z128xxx7_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MKL82Z128VMP7">
          <compile header="fsl_device_registers.h" define="CPU_MKL82Z128VMP7"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKL82Z128VMP7/MKL82Z128xxx7_flash.scf"</LMisc>
          </environment>
        </variant>
      </device>
    </family>
  </devices>
  <conditions>
    <condition id="cond_MCUXpressoConfigTools">
      <accept Dname="MKL82Z128???7" Dvendor="NXP:11"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="device.MKL82Z7_AND_driver.dmamux_AND_driver.edma">
      <accept Dname="MKL82Z128???7" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux"/>
    </condition>
    <condition id="device.MKL82Z7_AND_driver.edma_AND_driver.lpuart">
      <accept Dname="MKL82Z128???7" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
    </condition>
    <condition id="device.MKL82Z7_AND_utility.debug_console">
      <accept Dname="MKL82Z128???7" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
    </condition>
    <condition id="device.MKL82Z7_AND_driver.common">
      <accept Dname="MKL82Z128???7" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.MKL82Z7_AND_component.lists_AND_utility.debug_console">
      <accept Dname="MKL82Z128???7" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
    </condition>
    <condition id="device.MKL82Z7">
      <accept Dname="MKL82Z128???7" Dvendor="NXP:11"/>
    </condition>
    <condition id="device.MKL82Z7_AND_driver.lpuart">
      <accept Dname="MKL82Z128???7" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
    </condition>
    <condition id="device.MKL82Z7_AND_component.serial_manager_AND_driver.common">
      <accept Dname="MKL82Z128???7" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
